import pandas as pd
import numpy as np
import re
import sys
sys.path.append(r'/Users/zhouzhan/Documents/codes/python_code/liver_disease/liver_disease/')
import constants


def combineSHE_TI(df):
    #'舌体'
    df['舌体_胖大'] = df['舌体_胖大'] + df['舌体_胖大齿痕']
    df['舌体_齿痕'] = df['舌体_齿痕'] + df['舌体_胖大齿痕']
    del df['舌体_胖大齿痕']
    return df

def combineSHE_ZHI(df):
    # '舌质'
    df['舌质_暗紫'] = df['舌质_暗紫红'] + df['舌质_暗紫']
    del df['舌质_暗紫红']
    return df

def combineSHE_XIA_MAI_LUO(df):
    # '舌下脉络'
    # {'脉络_正常':'脉络正常|舌下脉络正常', '脉络_迂曲':'脉络迂曲', '脉络_瘀斑':'瘀斑或瘀条|瘀点',
    #                  '脉络_增粗':'脉络增粗', '脉络_瘀点迂曲':'瘀点脉络迂曲'} 
    df['脉络_瘀斑'] = df['脉络_瘀斑'] + df['脉络_瘀点迂曲']
    df['脉络_迂曲'] = df['脉络_迂曲'] + df['脉络_瘀点迂曲']
    del df['脉络_瘀点迂曲']
    return df

def combineSHE_TAI(df):
    # '舌苔'
    # {'舌苔_腻白':'白腻|腻白|白微腻', '舌苔_腻黄':'黄腻|腻黄|腻略黄', '舌苔_黄':'黄', '舌苔_湿润白腻厚':'湿润白厚腻', '舌苔_腻白少':'白腻少', 
    # '舌苔_腻白厚':'白腻厚|白厚腻',
    # '舌苔_黄少':'黄少', '舌苔_黄腻少':'黄腻少', '舌苔_黄厚腻':'腻厚黄|黄腻厚|厚腻黄|黄厚腻.', '舌苔_黄厚':'黄厚', '舌苔_腻少':'少腻',
    #  '舌苔_湿润黄少':'湿润黄少', '舌苔_腻':'腻',
    # '舌苔_白湿润腻':'白湿润腻', '舌苔_白':'白', '舌苔_厚腻湿润':'厚腻湿润', '舌苔_黄干燥少':'黄干燥少', '舌苔_腐黄腻':'腐黄腻', 
    # '舌苔_厚腻腐黄白':'厚腻腐黄白', '舌苔_湿润黄腻':'湿润黄腻',
    # '舌苔_腻湿润':'腻湿润', '舌苔_湿润':'湿润', '舌苔_白黄腻':'白黄腻|白腻黄', '舌苔_薄白':'薄白', 
    # '舌苔_少':'少', '舌苔_白少':'少白',
    # '舌苔_干燥灰黑腻黄':'干燥灰黑腻黄', '舌苔_薄黄腻':'薄黄腻|腻薄黄', '舌苔_白灰黑腻':'白灰黑腻', '舌苔_薄黄厚腻':'薄黄厚腻',
    # '舌苔_白腻中间有裂痕':'白腻中间有裂痕',
    # '舌苔_白厚':'白厚', '舌苔_少薄黄':'少薄黄', '舌苔_黄干燥':'黄干燥'}

    df['舌苔_腻黄'] = df['舌苔_薄黄厚腻']
    #1,质（薄，厚，润，燥，腻，腐，剥，偏，全，真，假）;2,色（白，黄，灰黑）少
    df['舌苔_白'] = df['舌苔_腻白'] + df['舌苔_湿润白腻厚'] + df['舌苔_腻白少'] + df['舌苔_腻白厚'] + df['舌苔_白湿润腻']
    + df['舌苔_白'] + df['舌苔_厚腻腐黄白'] + df['舌苔_白黄腻'] + df['舌苔_薄白'] + df['舌苔_白少'] + df['舌苔_白灰黑腻'] + df['舌苔_白腻中间有裂痕']
    + df['舌苔_白厚']

    df['舌苔_黄'] = df['舌苔_腻黄'] + df['舌苔_黄'] + df['舌苔_黄少'] + df['舌苔_黄腻少'] + df['舌苔_黄厚腻'] + df['舌苔_黄厚']
    + df['舌苔_湿润黄少'] + df['舌苔_黄干燥少'] + df['舌苔_腐黄腻'] + df['舌苔_厚腻腐黄白'] + df['舌苔_湿润黄腻']
    + df['舌苔_白黄腻'] + df['舌苔_干燥灰黑腻黄'] + df['舌苔_薄黄腻'] + df['舌苔_少薄黄'] + df['舌苔_黄干燥']

    df['舌苔_灰黑'] = df['舌苔_干燥灰黑腻黄'] + df['舌苔_白灰黑腻']
    df['舌苔_薄'] = df['舌苔_薄白'] + df['舌苔_薄黄腻'] + df['舌苔_少薄黄']
    df['舌苔_厚'] = df['舌苔_湿润白腻厚'] + df['舌苔_腻白厚'] + df['舌苔_黄厚腻'] + df['舌苔_黄厚'] + df['舌苔_厚腻湿润'] + df['舌苔_白厚']
    df['舌苔_润'] = df['舌苔_湿润白腻厚'] + df['舌苔_湿润黄少'] + df['舌苔_白湿润腻'] + df['舌苔_厚腻湿润'] + df['舌苔_湿润黄腻']
    + df['舌苔_腻湿润'] + df['舌苔_湿润']

    df['舌苔_燥'] = df['舌苔_黄干燥少'] + df['舌苔_干燥灰黑腻黄'] + df['舌苔_黄干燥']
    df['舌苔_腻'] = df['舌苔_腻白'] + df['舌苔_腻黄'] + df['舌苔_湿润白腻厚'] + df['舌苔_腻白少'] + df['舌苔_腻白厚'] + df['舌苔_黄腻少']
    + df['舌苔_黄厚腻'] + df['舌苔_腻少'] + df['舌苔_腻'] + df['舌苔_白湿润腻'] + df['舌苔_厚腻湿润'] + df['舌苔_腐黄腻'] + df['舌苔_厚腻腐黄白']
    + df['舌苔_湿润黄腻'] + df['舌苔_腻湿润'] + df['舌苔_白黄腻'] + df['舌苔_干燥灰黑腻黄'] + df['舌苔_薄黄腻'] + df['舌苔_白灰黑腻']
    + df['舌苔_薄黄厚腻'] + df['舌苔_白腻中间有裂痕']

    df['舌苔_腐'] = df['舌苔_厚腻腐黄白'] + df['舌苔_腐黄腻']
    df['舌苔_少'] = df['舌苔_腻白少'] + df['舌苔_黄少'] + df['舌苔_黄腻少'] + df['舌苔_腻少'] + df['舌苔_黄干燥少'] + df['舌苔_少']
    + df['舌苔_白少'] + df['舌苔_少薄黄']

    df['舌苔_裂'] = df['舌苔_白腻中间有裂痕']

    del df['舌苔_腻白']; del df['舌苔_腻黄']; del df['舌苔_湿润白腻厚']; del df['舌苔_腻白少']; del df['舌苔_腻白厚']; del df['舌苔_黄少']
    del df['舌苔_黄腻少']; del df['舌苔_黄厚腻']; del df['舌苔_黄厚']; del df['舌苔_腻少']; del df['舌苔_湿润黄少']; del df['舌苔_白湿润腻']
    del df['舌苔_厚腻湿润']; del df['舌苔_黄干燥少']; del df['舌苔_腐黄腻']; del df['舌苔_厚腻腐黄白']; del df['舌苔_湿润黄腻']; del df['舌苔_腻湿润']
    del df['舌苔_湿润']; del df['舌苔_白黄腻']; del df['舌苔_白灰黑腻']; del df['舌苔_薄黄厚腻']; del df['舌苔_白腻中间有裂痕']; del df['舌苔_白厚']
    del df['舌苔_少薄黄']; del df['舌苔_黄干燥']; del df['舌苔_干燥灰黑腻黄']; del df['舌苔_薄黄腻']; del df['舌苔_白少'];del df['舌苔_薄白']
    
    return df

def combineSHE_MAI_XIANG(df):
    # '脉象':弦、滑、细、数、弱、沉
    # {'脉象_弦':'弦|弦弦', '脉象_弦滑':'弦滑|滑弦', '脉象_弦数':'弦数', '脉象_弦细':'弦细', '脉象_细弱':'细弱', 
    #                 '脉象_沉细':'沉细', '脉象_实弦':'实弦', '脉象_细数弦':'细数弦', '脉象_实':'实', 
    #                 '脉象_细':'细', '脉象_弦弱':'弦弱', '脉象_细沉数弦':'细沉数弦', '脉象_濡':'濡', '脉象_弦缓':'弦缓', '脉象_滑':'滑'} 

    df['脉象_弦'] = df['脉象_弦'] + df['脉象_弦滑'] + df['脉象_弦数'] + df['脉象_弦细'] + df['脉象_细数弦'] + df['脉象_实弦'] 
    + df['脉象_弦弱'] + df['脉象_细沉数弦'] + df['脉象_弦缓']

    df['脉象_滑'] = df['脉象_弦滑'] + df['脉象_滑']
    df['脉象_细'] = df['脉象_弦细'] + df['脉象_细弱'] + df['脉象_沉细'] + df['脉象_细数弦'] + df['脉象_细'] + df['脉象_细沉数弦']
    df['脉象_数'] = df['脉象_弦数'] + df['脉象_细数弦'] + df['脉象_细沉数弦']
    df['脉象_弱'] = df['脉象_细弱'] + df['脉象_弦弱']
    df['脉象_沉'] = df['脉象_沉细'] + df['脉象_细沉数弦']
    df['脉象_实'] = df['脉象_实'] + df['脉象_实弦']

    del df['脉象_弦滑']
    del df['脉象_弦数']
    del df['脉象_弦细']
    del df['脉象_细弱']
    del df['脉象_沉细']
    del df['脉象_实弦']
    del df['脉象_细数弦']
    del df['脉象_弦弱']
    del df['脉象_细沉数弦']
    del df['脉象_弦缓']

    return df